tutorials/beamTunnel/beamTunnel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 -0.02)
    (4 0 -0.02)
    (4 1 -0.02)
    (0 1 -0.02)

    (0 0 0.02)
    (4 0 0.02)
    (4 1 0.02)
    (0 1 0.02)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 38 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    upperWall
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type symmetry;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);



// ************************************************************************* //
